#Дз17
"""Расширить функционал прошлого ДЗ:
Имитировать неудачную попытку входа в систему с блокировкой пользователя на 5 минут.
Выводить сообщение "Вы заблокированы! Следующая попытка через N мин."
для решение понадобится
хранить дату/время - последняя НЕ удачная попытка входа
действия с датой лучше вынести в отдельные функци
т.к. мы не храним данные пользователя в базе данных или файле мы имитируем такую ситуацию,
в нашем случае программа всегда будет выводить сообщение "Вы заблокированы!
Следующая попытка через N мин."""
